Revit 2026 API

# ViewOrigin Property

---

Returns the origin of the screen.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; }
```
```vb
Public ReadOnly Property Origin As XYZ
	Get
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```
```fsharp
member Origin : XYZ with get
```

#### Property Value

XYZ if the view is a template.

The origin of a plan view is not meaningful.

#### Reference

View Class

Autodesk.Revit.DB Namespace